import React, { useState } from 'react';
import style from '../styles/landingApp/superiorities.less';
import Title from './components/Title';
// import AliceCarousel from 'react-alice-carousel';
// import 'react-alice-carousel/lib/alice-carousel.css';

// const responsive = {
//     0: { items: 1 },
//     840: { items: 2 },
//     1024: { items: 3 },
//     1500: { items: 4 },
// };

const superiorities = [
    'Невеликі розміри (достатні для транспотування як в салоні так і багажнику пікапа)',
    'Невелика вага (не зважаючи на стальні елементи підсилення) за рахунок місцевого використання більш міцних та тонкостінних труб з АМГ3 та Д16т',
    'Порошкове пофарбування, надає маскування та зручність в складанні\\розкладанні (менше тертя, менше зусилля)',
    'Можливість монтажу на різноманітних поверхнях (за допомогою кігтів) та до різноманітних текстур типу стовбів, дерев, кутків приміщень з розбомбленими кришами (розташування ніжок та асиметричної основи дозволяє це робити)',
    'Телескопічна будова ніжок (в купі з рухомою деталлю-обмежувачем розкриття ніжок надають гнучкості при встановленні в обмеженому просторі або складному рельєфі)',
    'Асиметрична стопа мачти не дозволяє попадати бруду знизу і запобігає підклинюванню телескопічної системи',
    'Бульбашковий рівень для точного вертикального встановлення (пластик та рідина рівня пройшли тестування при -18С)',
    'Додаткова жорсткість встановленої мачти за рахунок фіксації хрестом основи',
    'Підсилені ніжки стальними елементами та квадратними трубами',
    'Мінімізована кількість пластикових деталей (мороз)',
    'Отвори-обмежувачі на кожній секції (або флюоресцентні мітки), для інтуітивного розуміння максимальної робочої довжини секції',
    'Ексцентрикові зажими підібрані з урахованням навантаження, на товстіших трубах використовуються потужніші зажими, на найтовстіших – детлі з більшою різьбою (М8 замість М6)',
    'Кілочки для розтяжок з кутка стального (значно стійкіший в грунті в порівнянні з стальним кругом)',
    'Кілочки для розтяжок кріпляться до троса через ланцюг та карабін, що значно зпрощує коригування натягу троса, навідміну від талтрепа з різьбою, який потрібно крутити і при забрудненні різьби вона може підклинити',
    'Швидкозйомна конструкція для монтажу приладів на вершину щогли (сумісна з всіма щоглами)',
    'Фіксація ніжок стяжкою з липучкою для зручності транспортування',
    'Конструкція щогли передбачає легку заміну будь-якого пошкодженого елемента на новий в польових умовах',
];

const Superiorities = React.memo(({ config, priceConfig }) => {

    return (
        <div className={style.Superiorities}>
            <div className={style.SuperioritiesInner}>
                <Title text={'переваги'}/>
                <div className={style.SuperioritiesList}>
                    {superiorities.map((item) => <div key={item} className={style.Superiority}>
                        <div className={style.Text}>
                            <img src={'/svg/services/arrow-small.svg'} className={style.Image}/>
                            <div className={style.Description}>{item}</div>
                        </div>
                    </div>)}
                </div>
            </div>
        </div>);
});

export default Superiorities;
